Revit 2024 API
AnalysisDisplayColoredSurfaceSettings Constructor (AnalysisDisplayColoredSurfaceSettings)
 Constructs a new copy of the input AnalysisDisplayColoredSurfaceSettings object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AnalysisDisplayColoredSurfaceSettings(
	AnalysisDisplayColoredSurfaceSettings other
)
Visual Basic
Public Sub New ( _
	other As AnalysisDisplayColoredSurfaceSettings _
)
Visual C++
public:
AnalysisDisplayColoredSurfaceSettings(
	AnalysisDisplayColoredSurfaceSettings^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalysisDisplayColoredSurfaceSettings Class
AnalysisDisplayColoredSurfaceSettings Overload
Autodesk.Revit.DB.Analysis Namespace